CI fix 4 | disabling SASL for Kafka+Zookeper + update arch file: mermaid instead of plantuml for better rendering
